---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyString
source: html/cee72e20-d4ff-9ab8-b7de-f8ecb2328217.htm
---
# AssetPropertyString Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.